var data=[];
var dataStr = '1、战争与和平<br>\
<br>\
&nbsp;&nbsp;1、每个人都会有缺陷，就象被上帝咬过的苹果，有的人缺陷比较大，正是因为上帝特别喜欢他的芬芳。<br>\
&nbsp;&nbsp;2、任何看似愚蠢的东西，它一定也有值得喝彩的地方。<br>\
<p align="right">--战争与和平</p><br>\
<br>\
<br>\
2、巴黎圣母院<br>\
<br>\
&nbsp;&nbsp;1. 一个人只要干了一件坏事，就想干尽一切坏事，除非他发了疯才会中途停止。<br>\
&nbsp;&nbsp;2. 于是他慢慢地垂下手臂，带着深深的悲苦望着地上：“要是这些石头能够说话，是哪，它们一定会说我是一个不幸的男子呢。<br>\
<p align="right">--巴黎圣母院</p><br>\
<br>\
<br>\
3、童年<br>\
<br>\
&nbsp;&nbsp;1.他放纵地舞着,仿佛打开门让他出去他就能跳遍全城!大家都被他感染,跟着他颤动起来. <br>\
&nbsp;&nbsp;2.怨恨是块冰,遇暖就融化.<br>\
<p align="right">--童年</p><br>\
<br>\
<br>\
4、呼啸山庄<br>\
<br>\
&nbsp;&nbsp;1.我说他的天堂只有一半的活力，他却说我的天堂过于喧闹，就像醉鬼。我说，我一到他的天堂就会昏昏欲睡。他说，我的天堂使他窒息。<br>\
&nbsp;&nbsp;2.惩罚恶人是上帝的事，我们应该学会饶恕。<br>\
<p align="right">--童年</p><br>\
<br>\
<br>\
5、大卫·科波菲尔<br>\
<br>\
&nbsp;&nbsp;1.内心的痛苦和忧患,对于某种性格的人,抵得若干年纪.<br>\
&nbsp;&nbsp;2.水远不要把你今天可以做的事留到明天做.延宕是偷光阴的贼.抓住他吧.<br>\
<p align="right">--大卫·科波菲尔</p><br>\
<br>\
<br>\
6、红与黑<br>\
<br>\
&nbsp;&nbsp;1.每个人的心底都有一座坟墓，是用来埋葬所爱的人的。<br>\
&nbsp;&nbsp;2.但是他年轻的血沸腾着不允许他在这种烟雾似的梦幻中浪费太多时光。他已经厌倦了这虚无缥缈的占有，他渴望抓住梦境。<br>\
<p align="right">--红与黑</p><br>\
<br>\
<br>\
7、悲惨世界<br>\
<br>\
&nbsp;&nbsp;1.没有什么比信念更能创造梦想，也没有什么比梦想更能孕育未来。<br>\
&nbsp;&nbsp;2.黑夜沉沉,没有一点星光。肯定有一个展开双翼的大天使,站在黑暗中等待这颗灵魂。<br>\
<p align="right">--悲惨世界</p><br>\
<br>\
<br>\
8、安娜·卡列尼娜<br>\
<br>\
&nbsp;&nbsp;1.安娜可以不屑于世俗的嘲笑和讥讽，但却不得不受到婚姻制度的困扰。<br>\
&nbsp;&nbsp;2.真理与美善就像道一样玄妙深微，不可言说，无影无踪。丰富啊，可以包容宇宙，博大啊，可以气吞山河。只有对生命的深刻体悟，才能感知到它们的存在。\
<p align="right">--安娜·卡列尼娜</p><br>\
<br>\
<br>\
9、约翰·克利斯朵夫<br>\
<br>\
&nbsp;&nbsp;1.大部分人在二三十岁上就死去了，因为过了这个年龄，他们只是自己的影子，此后的余生则是在模仿自己中度过，日复一日，更机械，更装腔作势地重复他们在有生之年的所作所为，所思所想，所爱所恨。<br>\
&nbsp;&nbsp;2.当你知道世界上受苦的不是只有你，你会减少痛苦，也会在绝望中燃起希望.<br>\
<p align="right">--约翰·克利斯朵夫</p><br>\
<br>\
<br>\
10、失乐园<br>\
<br>\
&nbsp;&nbsp;1.与其在天堂为仆，不如在地狱为主。<br>\
&nbsp;&nbsp;2.心灵是一个特别的地方，在那里可以把天堂变成地狱，把地狱变成天堂。<br>\
<p align="right">--失乐园</p><br>\
<br>\
<br>\
11、简·爱<br>\
<br>\
&nbsp;&nbsp;1.凶手和恋人都喜欢事后重返现场。<br>\
&nbsp;&nbsp;2.枕头是离梦想最近的地方。<br>\
<p align="right">--简·爱</p><br>\
<br>\
<br>\
12、傲慢与偏见<br>\
<br>\
&nbsp;&nbsp;1.要是爱你爱的少许，话就可以说的多些了。<br>\
&nbsp;&nbsp;2.要是他没有触犯我的骄傲，我也很容易原谅他的骄傲。<br>\
<p align="right">--傲慢与偏见</p><br>\
<br>\
<br>\
13、永别了，武器<br>\
<br>\
&nbsp;&nbsp;1.生活总是让我们遍体鳞伤，但是后来，那些受伤的地方一定会变成我们最强壮的地方。<br>\
&nbsp;&nbsp;2.相爱的人不该争吵，因为他们只有两人，与他们作对的是整个世界，他们一发生隔膜，世界就会将其征服。<br>\
<p align="right">--永别了，武器</p><br>\
<br>\
<br>\
14、了不起的盖茨比<br>\
<br>\
&nbsp;&nbsp;1.如果打算爱一个人，你要想清楚，是否愿意为了他，放弃如上帝般自由的心灵，从此心甘情愿有了羁绊。<br>\
&nbsp;&nbsp;2.世界上只有被追求者和追求者，忙碌者和疲惫者。<br>\
<p align="right">--了不起的盖茨比</p><br>\
<br>\
<br>\
15、麦田里的守望者<br>\
<br>\
&nbsp;&nbsp;1.你不管做什么事，如果做得太好了，一不警惕，就会在无意中卖弄起来。那样的话，你就不再那么好了。<br>\
&nbsp;&nbsp;2.麻烦就在这里。你永远找不到一个舒服、宁静的地方，因为这样的地方并不存在。<br>\
<p align="right">--麦田里的守望者</p><br>\
<br>\
<br>\
16、局外人<br>\
<br>\
&nbsp;&nbsp;1.我已经没有时间去对我不感兴趣的事情再产生兴趣。<br>\
&nbsp;&nbsp;2.于是我悟出了，一个人即使只生活过一天，他也可以在监狱待上一百年而不至于难以度日，他有足够的东西可供回忆，决不会感到烦闷无聊。从某种意义上来说，这也是一种愉快。<br>\
<p align="right">--局外人</p><br>\
<br>\
<br>\
17、童年<br>\
<br>\
&nbsp;&nbsp;1.一无所有的脸上，连伤痕也是点缀。<br>\
&nbsp;&nbsp;2.世界上最快而又最慢，最长而又最短，最平凡而又最珍惜，最容易被人忽视而又最令人后悔的就是时间。<br>\
<p align="right">--童年</p><br>\
<br>\
<br>\
';
//下面的代码是将dataStr中的内容拆分存放到data数组中
var d = dataStr.split('<br><br><br>');
for(var i = 0;i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img:'photo_'+(i+1)+'.jpg',
        caption:c[0].split('、')[1],
        desc:c[1]
    });
}

